#Область СлужебныеПроцедурыИФункции

Функция ОправитьСообщениеТелеграм(Текст) Экспорт 
	
	IDГруппы = Константы.ВКМ_IDГруппы;//-1004368728266	
	ТокенTelegramm= Константы.ВКМ_ТокенTelegramm; //8982220341:AAHzsUJj5m44x66obn98KoJu6iXPcFhxHNA
	
	ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение();
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,ЗащищенноеСоединение);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	Запрос=Новый HTTPЗапрос("bot" + ТокенTelegramm + "/sendMessage", Заголовки);
		
	ДанныеЗапроса = новый структура;
	ДанныеЗапроса.Вставить("chat_id",IDГруппы);
	ДанныеЗапроса.Вставить("text",Текст);
		
	ЗаписьJSON = новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеЗапроса);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
		
	Запрос.УстановитьТелоИзСтроки(СтрокаЗапроса);
		
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
		
	Если Ответ.КодСостояния = 200 Тогда
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Успех: " + ТелоОтвета;
		Сообщение.Сообщить();
		Возврат Истина;
	Иначе
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ТекстОшибки = СтрШаблон("Ошибка отправки: %1. Описание ошибки: %2", Ответ.КодСостояния, ТелоОтвета);
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстОшибки;
		Сообщение.Сообщить();
		ЗаписьЖурналаРегистрации("ОшибкаОтправки.Телеграм",УровеньЖурналаРегистрации.Ошибка,
			 , , ТекстОшибки,);
		Возврат Ложь;     
	КонецЕсли;

	
КонецФункции	

Процедура ОтправкаУведомленийТелеграм() Экспорт
	
	МассивНаУдаление = Новый Массив;
	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = ОправитьСообщениеТелеграм(Выборка.ТекстСообщения);
		Если Результат Тогда
			МассивНаУдаление.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СсылкаНаУдаление Из МассивНаУдаление Цикл
		ОбъектДляУдаления = СсылкаНаУдаление.ПолучитьОбъект();
		ОбъектДляУдаления.Удалить();
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
