#language: ru

@tree

Функционал: Использование массового создания актов

Как Бухгалтер я хочу
использовать массовое создание актов 
чтобы просмотреть созданные акты   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Я использую массовое создание актов

И В командном интерфейсе я выбираю "Обслуживание клиентов" "Массовое создание актов"
Тогда открылось окно "Массовое создание актов"
И я нажимаю кнопку выбора у поля с именем 'Период'
И в поле с именем 'Период' я ввожу текст "09.2026"
И я нажимаю на кнопку с именем 'ФормаЗаполнитьИСоздать'
