#language: ru

@tree

Функционал: Планирование нескольких обслуживаний на специалистов

Как Менеджер я хочу
запланировать несколько обслуживаний 
чтобы специалисты отработали   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Я создаю нескольких обслуживаний

И В командном интерфейсе я выбираю "Обслуживание клиентов" "Обслуживание клиентов"
Тогда открылось окно "Обслуживание клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И я нажимаю кнопку выбора у поля с именем 'Клиент'
Тогда открылось окно "Контрагенты"
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование" |
	| "000000001" | "ИТ Клиент"    |
И я нажимаю на кнопку с именем 'ФормаВыбрать'
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'Договор'
Тогда открылось окно "Договоры контрагентов"
И в таблице 'Список' я перехожу к строке:
	| "Код"       | "Наименование"            |
	| "000000005" | "Договор Обслуживание 1с" |
И я нажимаю на кнопку с именем 'ФормаВыбрать'
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'Специалист'
Тогда открылось окно "Выбор пользователя"
И в таблице 'ПользователиСписок' я перехожу к строке:
	| "Полное имя" |
	| "Специалист" |
И я нажимаю на кнопку с именем 'ВыбратьПользователя'
Тогда открылось окно "Обслуживание клиента (создание) *"
И я нажимаю кнопку выбора у поля с именем 'ДатаПроведенияРабот'
И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "29.09.2026"
И в поле с именем 'ВремяНачалаРаботПлан' я ввожу текст " 9:00:00"
И в поле с именем 'ВремяОкончанияРаботПлан' я ввожу текст "16:00:00"
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно "Обслуживание клиента * от *"
И Я закрываю окно "Обслуживание клиента * от *"
Тогда открылось окно "Обслуживание клиентов"
И я нажимаю на кнопку с именем 'ФормаСоздать'
Тогда открылось окно "Обслуживание клиента (создание)"
И из выпадающего списка с именем 'Клиент' я выбираю точное значение "ИТ Клиент"
И из выпадающего списка с именем 'Договор' я выбираю точное значение "Договор Обслуживание 1с"
И из выпадающего списка с именем 'Специалист' я выбираю точное значение "Специалист"
И в поле с именем 'ДатаПроведенияРабот' я ввожу текст "30.09.2026"
И в поле с именем 'ВремяНачалаРаботПлан' я ввожу текст "10:00:00"
И в поле с именем 'ВремяОкончанияРаботПлан' я ввожу текст "15:00:00"
И я нажимаю на кнопку с именем 'ФормаЗаписать'
Тогда открылось окно "Обслуживание клиента * от *"
И Я закрываю окно "Обслуживание клиента * от *"
