#language: ru

@tree

Функционал: Формирование отчёта Анализ выставленных актов и сравнение с эталоном

Как Бухгалтер я хочу
сформировать отчёт Анализа выставленных актов
чтобы проверить с эталоном    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Я формирую отчёт Анализа выставленных актов и сравниваю с эталоном

И В командном интерфейсе я выбираю "Обслуживание клиентов" "Анализ выставленных актов"
Тогда открылось окно "Основной"
И я нажимаю кнопку выбора у поля с именем 'КомпоновщикНастроекПользовательскиеНастройкиЭлемент0Значение'
Тогда открылось окно "Выберите период"
И я нажимаю на кнопку с именем 'Select'
Тогда открылось окно "Основной"
И я нажимаю на кнопку с именем 'СформироватьОтчет'
Тогда табличный документ 'ОтчетТабличныйДокумент' равен:
	| 'Анализ выставленных актов' | ''                                | ''                 | ''                      |
	| ''                          | ''                                | ''                 | ''                      |
	| 'Параметры:'                | 'Период: 01.01.2026 - 31.12.2026' | ''                 | ''                      |
	| ''                          | ''                                | ''                 | ''                      |
	| 'Клиент'                    | 'Договор'                         | 'Абоненская плата' | 'Стоимость часа работы' |
	| 'ИТ Клиент'                 | 'Договор1'                        | '5 000,00'         | '100,00'                |
	| 'ООО Окна'                  | 'Договор Обслуживание 1с'         | '3 000,00'         | '170,00'                |
	| 'ОАО СургутСети'            | 'Договор Обслуживание 1с'         | '8 000,00'         | '250,00'                |
	| 'ИТ Клиент'                 | 'Договор Обслуживание 1с'         | '20 000,00'        | '300,00'                |

