#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	РеквизитыОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка,
		"ДатаПроведенияРабот, ВремяНачалаРаботПлан, Специалист");
	ЕстьИзменение = Ложь;
	НаименованиеИзменения = "Изменение документа №" + Номер;
	СообщениеОбИзменении = "В документе обслуживание клиента №" + Номер + " были изменены: ";

	Если РеквизитыОбъекта.Специалист <> Специалист Тогда
		ЕстьИзменение = Истина;
		СообщениеОбИзменении = СообщениеОбИзменении + " Специалист на " + Специалист + "; ";
	КонецЕсли;
	Если РеквизитыОбъекта.ВремяНачалаРаботПлан <> ВремяНачалаРаботПлан Тогда
		ЕстьИзменение = Истина;
		СообщениеОбИзменении = СообщениеОбИзменении + " Время начала работ (план) на " + Формат(ВремяНачалаРаботПлан,"ДЛФ=T") + "; ";
	КонецЕсли;
	Если РеквизитыОбъекта.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
		ЕстьИзменение = Истина;
		СообщениеОбИзменении = СообщениеОбИзменении + " Дата проведения работ на " + Формат(ДатаПроведенияРабот,"ДЛФ=D");
	КонецЕсли;

	ДополнительныеСвойства.Вставить("ЕстьИзменение", ЕстьИзменение);
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("НаименованиеИзменения", НаименованиеИзменения);
	ДополнительныеСвойства.Вставить("СообщениеОбИзменении", СообщениеОбИзменении);

КонецПроцедуры
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ДополнительныеСвойства.ЭтоНовый Тогда

		НаименованиеЗаявки = "Новый документ №" + Номер;
		СообщениеНоваяЗаявка = СтрШаблон(
			"Новая заявка на обслуживание клиента № %1 от %2. Дата проведения работ % 3 время начала работ (план) %4",
			Номер, Дата, Формат(ДатаПроведенияРабот,"ДЛФ=D"), Формат(ВремяНачалаРаботПлан,"ДЛФ=T"));
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.Наименование = НаименованиеЗаявки;
		НовыйЭлемент.ТекстСообщения = СообщениеНоваяЗаявка;
		НовыйЭлемент.Записать();

	ИначеЕсли ДополнительныеСвойства.ЕстьИзменение Тогда

		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.Наименование = ДополнительныеСвойства.НаименованиеИзменения;
		НовыйЭлемент.ТекстСообщения = ДополнительныеСвойства.СообщениеОбИзменении;
		НовыйЭлемент.Записать();

	КонецЕсли;

КонецПроцедуры
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
	|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора
	|ПОМЕСТИТЬ ВТ_Док
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка,
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
	|	ВТ_Док.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ВТ_Док.ВидДоговора КАК ВидДоговора,
	|	ВТ_Док.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
	|	ВТ_Док.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
	|	ВТ_Док.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора
	|ИЗ
	|	ВТ_Док КАК ВТ_Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
	|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_Док.Ссылка.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Если Не ВыборкаДетальныеЗаписи.ВидДоговора = ПредопределенноеЗначение(
			"Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда

			ОбщегоНазначения.СообщитьПользователю(
				"Проведение документа отменено. Выбранный договор не являеться абоненским обслуживанием.");
			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Если Дата < НачалоДня(ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора) Или Дата > КонецДня(
			ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора) Тогда

			ОбщегоНазначения.СообщитьПользователю(
				"Проведение документа отменено. Дата находиться вне периода действия договора.");
			Отказ = Истина;
			Возврат;

		КонецЕсли;

		Если ВыборкаДетальныеЗаписи.ПроцентОтРабот = Null Тогда
			ТекстСообщения = СтрШаблон("Сотруднику %1 не указан процент от работ в условиях оплаты", Специалист);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
	
	//регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Специалист;
		Движение.ЧасовКОплате = ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = (ВыборкаДетальныеЗаписи.ЧасыКОплатеКлиенту * ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы
			* ВыборкаДетальныеЗаписи.ПроцентОтРабот) / 100;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли