#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СозданиеСписка(Дата) Экспорт


	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДанныеДоговоров
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	МЕСЯЦ(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора) <= МЕСЯЦ(&Дата)
	|	И ГОД(ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора) <= ГОД(&Дата)
	|	И МЕСЯЦ(ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора) >= МЕСЯЦ(&Дата)
	|	И ГОД(ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора) >= ГОД(&Дата)
	|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ДанныеРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачало И &ДатаОкончание
	|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеДоговоров.Ссылка КАК Договор,
	|	ЕСТЬNULL(ВТ_ДанныеРеализации.Ссылка, """") КАК Реализация,
	|	ВТ_ДанныеДоговоров.Организация КАК Организация,
	|	ВТ_ДанныеДоговоров.Контрагент КАК Контрагент
	|ИЗ
	|	ВТ_ДанныеДоговоров КАК ВТ_ДанныеДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеРеализации КАК ВТ_ДанныеРеализации
	|		ПО ВТ_ДанныеДоговоров.Ссылка = ВТ_ДанныеРеализации.Договор";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("ДатаНачало", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончание", КонецМесяца(Дата));

	Результат = Запрос.Выполнить().Выбрать();

	МассивРезультатов = Новый Массив;

	Пока Результат.Следующий() Цикл
		ЗначениеРеализации = Новый Структура;
	
		Если Результат.Реализация = "" Тогда
			НоваяРеализация = СозданиеДокументаРеализация(Результат, КонецМесяца(Дата));
			ЗначениеРеализации.Вставить("Договор", Результат.Договор);
			ЗначениеРеализации.Вставить("Реализация", НоваяРеализация);
		Иначе
			ЗначениеРеализации.Вставить("Договор", Результат.Договор);
			ЗначениеРеализации.Вставить("Реализация", Результат.Реализация);
		КонецЕсли;
	
		МассивРезультатов.Добавить(ЗначениеРеализации);

	КонецЦикла;

	Возврат МассивРезультатов;

КонецФункции


Функция СозданиеДокументаРеализация(РезультатЗапроса, Дата)

	НовыйДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
	НовыйДокументРеализация.Дата = Дата;
	НовыйДокументРеализация.Договор = РезультатЗапроса.Договор;
	НовыйДокументРеализация.Контрагент = РезультатЗапроса.Контрагент;
	НовыйДокументРеализация.Организация = РезультатЗапроса.Организация;
	НовыйДокументРеализация.ВКМ_ВыполнитьАвтозаполнение();
	
	// не будет создаваться так как обязательное поле для заполнения основание
	Если НовыйДокументРеализация.ПроверитьЗаполнение() Тогда
		
		НовыйДокументРеализация.Записать();
		НоваяСсылка = НовыйДокументРеализация.Ссылка;
		
	Иначе
		
		//ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось создать документ реализации по Договору: %1", РезультатЗапроса.Договор));
		//НоваяСсылка = "";
		
		//добавила для создания без проведения
		НовыйДокументРеализация.Записать();
		НоваяСсылка = НовыйДокументРеализация.Ссылка;
	
	КонецЕсли;

	Возврат НоваяСсылка;

КонецФункции

#КонецОбласти

#КонецЕсли