#Область ОбработчикиСобытийФормы
//ВКМ_Добавление реквизитов программно
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ Лавриненко: Добавление реквизитов для абоненской платы
		
	Элемент = Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора",Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора"; 
	
	Элемент = Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора",Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора"; 
	
	Элемент = Элементы.Добавить("ВКМ_СуммаАбоненскойПлаты",Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты"; 
	
	Элемент = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"));
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	Элемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
	
	ВКМ_УстановитьВидимостьРеквизитовАбоненскойПлаты();
	//-- Лавриненко
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

//ВКМ_Установка видимости элементов абонеской платы при изменении вида договора
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_УстановитьВидимостьРеквизитовАбоненскойПлаты();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ВКМ_Установка видимости элементов абонеской платы
&НаСервере
Процедура ВКМ_УстановитьВидимостьРеквизитовАбоненскойПлаты()
	//++ Лавриненко: Установка видимости элементов

	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
	
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Истина; 
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	Иначе
		
		Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбоненскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
	
	КонецЕсли;

	//-- Лавриненко
КонецПроцедуры

#КонецОбласти