#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда

    	Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
		|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник";

		Запрос.УстановитьПараметр("Дата", Объект.Дата);
		Результат = Запрос.Выполнить().Выбрать();

		Объект.Выплаты.Очистить();

		Пока Результат.Следующий() Цикл

			Строка = Объект.Выплаты.Добавить();
			Строка.Сотрудник = Результат.Сотрудник;
			Строка.Сумма = Результат.СуммаОстаток;

		КонецЦикла;

    КонецЕсли;
	
КонецПроцедуры

#КонецОбласти